<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Deposit Language Lines
    |--------------------------------------------------------------------------
    |
    |
    */

    'deposits'              => 'Депозиты',
    'deposit_name'          => 'Название депозита',
    'deposit_description'   => 'Описание депозита',
    'what_del_deposit'      => 'Вы уверены что хотите удалить депозит ',
    'deposit_no'            => 'Нет такого депозита',
    
    'deposit_min_val'   => 'Минимальная сумма депозита',
    'deposit_max_val'   => 'Максимальная сумма депозита',
    'deposit_type_proc' => 'Тип начисления процентов',
    'deposit_random'    => 'Случайный процент из диапазона',
    'deposit_fixed'     => 'Фиксированный процент начисления', 
    'deposit_min_proc'  => 'Минимальный процент',
    'deposit_max_proc'  => 'Максимальный процент',
    'deposit_period'    => 'Регулярность начисления процентов',
    'deposit_p_day'     => 'Ежедневно',
    'deposit_p_week'    => 'Раз в месяц',
    'deposit_p_month'   => 'Раз в месяц',
    
    'edit_deposit'    => 'Редактирование депозита',
    'update_deposit'  => 'Обновить депозит',
    'updated_deposit' => 'Успешно обновлён депозит ',
    
    'deposit_create'    => 'Создание условий, для нового депозита',
    'deposit_create_btn'=> 'Создать дипозит',
    'deposit_created'   => 'Успешно создан депозит',
    
    'deposit_deleted'   => 'Успешно удалён депозит',
    
    'deposit_show'      => 'Информация о депозите',
    
    'deposit_status'    => 'Депозит доступен/отключён',
    'deposit_expired_day' => 'Сколько дней до первого снятия',
    

    

    /*history*/
    'h_packet_created'        => 'Создан пакет депозитов <:name> , администратором :admin.',
    'h_packet_deleted'        => 'Удалён пакет депозитов <:name> , администратором :admin.',
    'h_packet_restored'       => 'Восстановлен пакет депозитов <:name> , администратором :admin.',
    
    'h_deposit_created'       => 'Создан депозит пользователем :name',
    'h_deposit_closed'        => 'Закрыт депозит пользователем :name',
    'h_deposit_deleted'       => 'Удалён депозит администратором :admin',
    
];